[
  {
    "title": "What is Omega 5.0?",
    "content": "Omega is FED’s flagship event, consisting of four unique segments focusing on developing entrepreneurship, strategic thinking, innovation, and leadership skills. It's open to students from KIIT and beyond."
  },
  {
    "title": "Who can participate in Omega 5.0?",
    "content": "Anyone can participate! You can register as an individual or as part of a team. You don’t have to be a KIIT student; students from other institutions are welcome too."
  },
  {
    "title": "How can I register for Omega 5.0?",
    "content": "The registration link is already available on our official Instagram page (@fedkiit). You can also register directly by visiting our website (fedkiit.com). Simply use the 'Sign in with Google' option to complete your registration quickly and securely!"
  },
  {
    "title": "Can the registration payment be done via the website?",
    "content": "Yes, participants can easily register and pay directly on the official website."
  },
  {
    "title": "What is the early bird offer?",
    "content": "Register before 10th August 2025 to avail the early bird price of ₹89 (instead of ₹129)."
  },
  {
    "title": "Is there a deadline for registration?",
    "content": "Yes, check the official social media or website for the exact registration deadlines. Early bird offers end on 10th August 2025."
  },
  {
    "title": "Where do I find the schedule for the event?",
    "content": "The main event will be held on 16th and 17th August.\nTIMINGS:\n10:00 AM – 2:00 PM\n3:00 PM – 6:00 PM"
  },
  {
    "title": "What are the main events in Omega 5.0?",
    "content": "Fedpreneur Show (The FED Show): 16th Aug\nFed Premier League (FPL): 16th Aug\nStrategic Pivot Challenge: 17th Aug\nInnovate X Hackathon: 17th Aug"
  },
  {
    "title": "Can a single participant take part in all the events?",
    "content": "Yes, contestants may compete in one or all events, alone or with a team."
  },
  {
    "title": "What is the Fedpreneur (FED) Show?",
    "content": "This is a special segment where entrepreneurial journeys, stories, and strategies are shared and discussed, offering insights into starting up and innovating."
  },
  {
    "title": "What is the Fed Premier League (FPL)?",
    "content": "An imitation of the Indian Premier League (IPL) cricket auction process, designed for a fun, team-based strategic experience."
  },
  {
    "title": "What is the Strategic Pivot Challenge?",
    "content": "A competition requiring participants to solve unique and realistic business challenges using critical thinking and quick decision-making."
  },
  {
    "title": "What is Innovate X Hackathon?",
    "content": "A hackathon challenging teams and individuals to come up with innovative solutions for real-world problems in a creative environment."
  },
  {
    "title": "How is this year’s Pitchers event different from previous editions?",
    "content": "This year, Pitchers will involve analyzing failed business ideas and pitching innovative solutions to improve or revive them."
  },
  {
    "title": "Is it necessary that all the team members belong to KIIT only?",
    "content": "No. Teams can be made up of students from KIIT or any other institution."
  },
  {
    "title": "What is the maximum or minimum team size?",
    "content": "Except for Fedpreneur Show, the rest are group events. But if you register alone and can’t find a friend to attend the event, don’t worry—we will combine you with someone prior to the event."
  },
  {
    "title": "What are the rewards/prizes?",
    "content": "Exciting prizes await the winners! Stay connected with our official announcements for detailed updates about prizes."
  },
  {
    "title": "How can I connect with the Organising Committee?",
    "content": "All the organizing members’ details are available on the website. You can also reach out via our official Instagram or website for any queries."
  },
  {
    "title": "Where can I get the latest updates about Omega and its rounds?",
    "content": "Follow @fedkiit on Instagram and keep checking fedkiit.com for real-time updates."
  },
  {
    "title": "Where will the events be conducted?",
    "content": "The event locations will be shared soon."
  },
  {
    "title": "What do I need to bring on event day?",
    "content": "Bring a valid ID and any materials specified in your event’s instructions."
  }
]


  